'''
Створити список, який складатиметься з 10 значень цілого типу. Організувати введення
цього списку з клавіатури. Серед елементів з непарними номерами (індексами)
знайдіть найбільший елемент списку, який ділиться на 3 без остачі. (Гарантовано, що в
списокі є хоча б один непарний елемент, який ділиться на 3).
Пояснення розв’язку
Оголошуємо список mas.
Організовуємо цикл з параметром i, де і буде змінюватися від 0 до 9 з кроком 1. В
тілі циклу організовуємо введення значення цілого типу у змінну el. Значення змінної
el заносимо в список mas.
Оголошуємо змінну ind та присвоюємо їй значення 1.
Організовуємо цикл while з умовою mas[ind]%3 !=0. В тілі циклу збільшуємо
значення ind на 2. В цьому циклі ми знайдемо перший елемент списку з непарним
номером, який кратний 3.
Оголошуємо змінну max для знаходження максимального елемента списку та
присвоюємо їй значення mas[ind].
Повторно використовуємо цикл з параметром i, який змінюється від ind до 9 з
кроком 2. В циклі перевіряємо чи виконуються одночасно дві умови mas[i] > max
та mas[i]%3 == 0 , якщо так, змінній max присвоюємо значення mas[i].
Виводимо значення max на екран.
'''

mas = []

for i in range(10):
    el = float(input("el ="))
    mas.append(el)

ind = 1

while mas[ind] % 3 != 0:
    ind = ind + 2

max = mas[ind]

for i in range(ind, 10, 2):
    if mas[i] > max and mas[i] % 3 == 0:
        max = mas[i]

print(max)

