'''
Надрукувати всі цілі числа від a до b включно, кратні деякому числу c. Числа a, b, c - цілі числа, які вводить користувач.
Пояснення розв’язку
Організовуємо ввід трьох чисел a, b, c. Для виводу послідовності чисел скористаємося циклом while, а умова виконання поки a<=b. В середині циклу для вибору саме тих чисел, що кратні c, перевіряємо чи остача від ділення а на с дорівнює нулю. Якщо умова виконується, то виводимо число на екран. Для переходу до наступного числа з діапазону збільшуємо значення a на одиницю. Після виходу з циклу завершуємо виконання програми.
'''

a = int(input("a ="))
b = int(input("b ="))
c = int(input("c ="))

while a <= b:
    if a % c == 0:
        print(a)
    a = a + 1