'''
Реалізувати програму, яка знаходить n-ий член арифметичної прогресії.

Додаткові умови:

Використовувати функцію print лише один раз для виводу результату задачі;
Результат роботи програми - ціле число;
Перший член арифметичної прогресії = 5;
Різниця арифметичної прогресії = 3;
Використати цикл for;
Порядковий номер шуканого члена арифметичної прогресії зберігається в змінній number.
Очікуваний результат виконання програми:

Для набору вхідних даних (number = 5) – результат на екрані – 17
Для набору вхідних даних (number = 6) – результат на екрані – 20
Додаткові матеріали:
Арифмети́чна прогре́сія — це послідовність дійсних чисел, кожен член якої, починаючи з другого, утворюється додаванням до попереднього члена одного й того ж числа, яке називається різницею арифметичної прогресії.

Приклад арифметичної прогресії: 1, 3, 5, 7, 9, 11, …
де перший член а = 1, а різниця між членами арифметичної прогресії d = 2
'''

number = int(input("Введіть шуканий член арифметичної прогресії "))
a = 5
d = 3
n = a


for i in range(1, number):
    n = n + d

print(n)
