'''
Описати клас Бандеромобіль (Banderomobil), який задовольняє наступні умови:

Конструктор класу приймає такі параметри і зберігає значення як атрибути об'єкту:
Кількість коліс (wheels_count), обов'язковий параметр;
Кількість місць (sits), обов'язковий параметр;
Бажана кількість зброї на борту (guns_count), обов'язковий параметр.
В конструкторі організувати підрахунок кількості створених об'єктів класу Бандеромобіль (cars_count).
Клас має наступні методи об'єкту:
Вивести інформацію про Бандеромобіль (print_info). Метод має вивести інформацію про авто: наприклад, при значенні заданих атрибутів об'єкта wheels_count = 4, sits = 5, guns_count = 25 метод виводить "Бандеромобіль на 4 колесах, призначений для 5 людей і 25 стволів".
Додаткові умови:
Кількість колес (wheels_count) вводиться користувачем з клавіатури;
Кількість місць (sits) вводиться користувачем з клавіатури;
Бажана кількість зброї на борту (guns_count) вводиться користувачем з клавіатури;
Обов'язково використати функцію format для виводу даних;
Використовуйте запропоновані назви методів і класів.
Очікуваний результат виконання програми:

Для набору вхідних даних (4, 5, 25) – текст на екрані:
Бандеромобіль на 4 колесах, призначений для 5 людей і 25 стволів
1
Бандеромобіль на 5 колесах, призначений для 6 людей і 26 стволів
2
Для набору вхідних даних (10, 33, 100500) – текст на екрані:
Бандеромобіль на 10 колесах, призначений для 33 людей і 100500 стволів
1
Бандеромобіль на 11 колесах, призначений для 34 людей і 100501 стволів
2
Увага!

Не змінюйте наведений стартовий код. Своє рішення набирайте під коментарем # your code goes here
Для позначення блоків коду використовуйте відступи в 4 пробіли.
Будьте уважні з вхідними даними.
Не використовуйте без нагальної потреби будь-які зайві символи в тексті, який ви виводите на екран - можуть виникати непередбачувані помилки під час автоматичної перевірки
'''

wheels_count = int(input("Введіть кількість коліс "))
sits = int(input("Введіть кількість місць "))
guns_count = int(input("Введіть кількість зброї "))

class Banderomobil:
    cars_count = 0

    def __init__(self, wheels_count, sits, guns_count):
        self.wheels_count = wheels_count
        self.sits = sits
        self.guns_count = guns_count
        Banderomobil.cars_count +=1
    
    def print_info(self):
        print("Бандеромобіль на {} колесах, призначений для {} людей і {} стволів".format(self.wheels_count, self.sits, self.guns_count))
    

car1 = Banderomobil(wheels_count, sits, guns_count )
car1.print_info()
print(car1.cars_count)

car2 = Banderomobil(wheels_count+1, sits+1, guns_count+1 )
car2.print_info()
print(car2.cars_count)