'''
Описати клас Речення (Sentence), який задовольняє наступні умови:

Конструктор класу приймає обов'язковий параметр речення (sentence) і зберігає значення, як атрибут об'єкту (sentence).
Клас має наступні методи об'єкту:
Змінити регістр на всі маленькі літери (назва методу - to_lower), задача якого змінити регістр значення атрибута об'єкту sentence на "всі літери маленькі";
Видалити введене слово (назва методу - remove_word), з обов'язковим параметром word_to_remove. Метод має видалити шукане слово в атрибуті об'єкта sentence і зберегти змінений стан цього атрибута;
Додати введений текст в кінець речення (назва методу - add_word), з обов'язковим параметром word_to_add. Метод має додати значення введеного параметру word_to_add в кінець атрибута об'єкта sentence і зберегти змінений стан цього атрибута;
Порівняти речення з введеним користувачем (назва методу - is_similar), з обов'язковим параметром sentence_to_compare. Метод має повернути True, якщо значення параметру sentence_to_compare співпадає зі значенням атрибуту об'єкту sentence або False, якщо не співпадає. Регістр при порівнянні має бути проігнорований.
Додаткові умови:
Використовуйте запропоновані назви методів і класів.
Очікуваний результат виконання програми:

Для набору вхідних даних ("Слава Україні!", "слава україні!", "Героям Слава!", "слава" ) – текст на екрані:
True
слава україні!героям слава!
 україні!героям !
Для набору вхідних даних ("Слава Україні!", "слава нації!", "Смерть Ворогам!", "слава" ) – текст на екрані:
False
слава україні!смерть ворогам!
 україні!смерть ворогам!
Підказка
Для видалення можна скористатися методом replace

Увага!

Не змінюйте наведений стартовий код.. Своє рішення набирайте під коментарем # your code goes here
Для позначення блоків коду використовуйте відступи в 4 пробіли.
Будьте уважні з вхідними даними
Не використовуйте без нагальної потреби будь-які зайві символи в тексті, який ви виводите на екран - можуть виникати непередбачувані помилки під час автоматичної перевірки
'''

input_sentence = input("Введіть речення: ")
sentence_to_compare = input("Введіть речення для порівняння: ")
new_word = input("Введіть нове слово, яке потрібно додати в кінець речення: ")
input_word_to_remove = input("Введіть слово яке потрібно вилучити: ")


class Sentence:
    def __init__(self, sentence):
        self.sentence = sentence

    def to_lower(self):
        self.sentence = self.sentence.lower()

    def remove_word(self, word_to_remove):
        self.sentence = self.sentence.replace(word_to_remove, "")

    def add_word(self, word_to_add):
        self.sentence += word_to_add

    def is_similar(self, sentence_to_compare):
        return self.sentence.lower() == sentence_to_compare.lower()

my_sentence = Sentence(input_sentence)
print(my_sentence.is_similar(sentence_to_compare))

my_sentence.add_word(new_word)
my_sentence.to_lower()
print(my_sentence.sentence)

my_sentence.remove_word(input_word_to_remove)
print(my_sentence.sentence)