'''
Описати клас Машини (Cars), який задовольняє наступні умови:

Клас має атрибут класу список автомобілів (list_of_cars);
Значення цього атрибуту за замовчуванням - пустий список.
Користувач має ввести 3 марки автомобіля з клавіатури.
Додати кожну введену марку автомобіля до атрибуту класу list_of_cars.
Вивести значення атрибуту класу list_of_cars на екран, змінивши стандартний знак поєднання (кома) на символи “ та ”.

Додаткові умови:
Обов'язково використати функцію format для виводу даних;
Обов'язково використати метод join для виводу списку на екран;
Обов'язково використати метод append для додавання марки авто до списку авто (list_of_cars);
Організувати звертання до атрибута класу виключно через ім'я класу;
Використовуйте запропоновані назви методів і класів.
Очікуваний результат виконання програми:

Для набору вхідних даних ('Toyota', 'Audi', 'Mazda') – текст на екрані – "Список авто: Toyota та Audi та Mazda"
Підказка:
Для зміни знака поєднання значень списку потрібно використати метод join
'''

car_1 = input("Введіть марку автомобіля 1 ")
car_2 = input("Введіть марку автомобіля 2 ")
car_3 = input("Введіть марку автомобіля 3 ")

class Cars:
    list_of_cars = []
    
    @classmethod
    def add_car(cars, car):
        cars.list_of_cars.append(car)
    
    @classmethod
    def display_cars(cars):
        cars_str = " та ".join(cars.list_of_cars)
        print("Список авто: {}".format(cars_str))

Cars.add_car(car_1)
Cars.add_car(car_2)
Cars.add_car(car_3)
Cars.display_cars()