'''
Створити клас Будівля (Building). Присвоїти йому під час виконання коду наступні атрибути класу:

Кількість вікон на кожному поверсі (windows_count);
Кількість поверхів (flors_count).
Вивести на екран загальну кількість вікон для будівлі.
Додаткові умови:
Кількість вікон вводиться користувачем з клавіатури;
Кількість поверхів вводиться користувачем з клавіатури;
Обов'язково використати функцію format для виводу даних;
Організувати звертання до атрибутів класу виключно через ім'я класу;
Загальну кількість вікон вирахувати за формулою: "Кількість вікон * Кількість поверхів";
Використовуйте запропоновані назви методів і класів.
Очікуваний результат виконання програми:

Для набору вхідних даних (2, 2) – текст на екрані – "Загальна кількість вікон 4"
Для набору вхідних даних (10, 52) – текст на екрані – "Загальна кількість вікон 520"
'''

windows_count = int(input("Введіть кількість вікон "))
flors_count = int(input("Введіть кількість поверхів "))

class Building:
    def __init__(self, windows_count, flors_count):
        self.windows_count = windows_count
        self.flors_count = flors_count
    
    def calculate_total_windows(self):
        total_windows = self.windows_count * self.flors_count
        return total_windows

building = Building(windows_count, flors_count)
print("Загальна кількість вікон {}".format(building.windows_count * building.flors_count))
