'''
Створити список , який складатиметься з 7 значень дійсного типу. Організувати
введення цього списку з клавіатури. Знайти добуток додатних елементів списку.
Пояснення розв’язку
Оголошуємо список mas.
Організовуємо цикл з параметром i, де і буде змінюватися від 0 до 6 з кроком 1. В
тілі циклу організовуємо введення значення дійсного типу у змінну el. Значення
змінної el заносимо в список mas.
Оголошуємо змінну result для знаходження добутку додатних елементів та
присвоюємо їй значення 1.
Повторно використовуємо цикл з параметром i. В циклі перевіряємо чи чергове
значення списку mas додатне, якщо так то, домножаємо значення змінної result
на відповідне значення списку mas .
Виводимо значення result на екран.
'''

mas = []

for i in range(7):
    el = float(input("el ="))
    mas.append(el)

result = 1

for i in range(7):
    if mas[i] > 0:
        result = result * mas[i]

print(result)
