'''
З клавіатури вводять число. Знайти суму цифр числа (див. задачу 9 алгоритми з
циклами)
Пояснення розв’язку
Організовуємо ввід числа n з клавіатури.
Оголошуємо список mas.
Використовуючи цикл while з умовою n !=0. В тілі циклу в список mas додаємо
значення n%10 та виконуємо дію n=n//10. Після закінчення циклу в списокі mas
буде записано всі цифри числа n.
Оголошуємо змінну sum для знаходження суми та присвоюємо їй значення 0.
Використовуємо цикл з параметром i, який змінюється від 0 до len(mas)-1 з
кроком 1 та почергово додаємо елементи списку mas до значення змінної sum.
Виводимо значення sum на екран.
'''

