'''
Створити список , який складатиметься з 12 значень дійсного типу. Організувати
введення цього списку з клавіатури. Знайдіть кількість елементів списку (включаючи
максимальний), які відмінні від найбільшого елемента не більше ніж на 30%.
Пояснення розв’язку
Для розв'язку задачі 5 скористаємося розв'язком задачі 4 (введення елементів списку
та пошук максимального).
Тепер оголошуємо змінну count, для знаходження кількості елементів, що
відрізняються від максимального не більше ніж на 30% та присвоюємо їй значення 0.
Втретє використовуємо цикл з параметром i та почергово порівнюємо чи значення
елементів списку mas більші або рівні значенню max*0.7, якщо так, то збільшуємо
значення змінної count на 1.
Виводимо значення count на екран.
'''

mas = []

for i in range(12):
    el = float(input("el ="))
    mas.append(el)

max = mas[0]

for i in range(12):
    if mas[i] > max:
        max = mas[i]

count = 0

for i in range(12):
    if mas[i] >= max * 0.7:
        count = count + 1

print(count)
