'''
Перевірити чи введене число є паліндромом
Пояснення розв’язку
Паліндром (перевертень) — слово, число, набір символів, словосполучення або віршований рядок, що однаково читається в обох напрямках. Наприклад: 123321, “дід”, “козак з казок”.
Організовуємо ввід числа n з клавіатури.
Оголошуємо список mas.
Використовуючи розв'язок задачі 8, заповнюємо список mas цифрами числа n.
Далі в змінну count збережемо половину довжини списку len(mas)//2.
Оголосимо змінну flag, якій присвоємо початкове значення True. Ця змінна буде індикатором того, що відповідні числа співпадають.
Організовуємо цикл з параметром i, де і буде змінюватися від 0 до count з кроком 1. В тілі циклу організовуємо порівняння mas[i] != mas[len(mas)-1-i], якщо умова виконується то присвоюємо flag значення False і виходимо з циклу.
Далі перевіряємо значення flag, якщо воно рівне True, то виводимо на екран “palindrome”, інакше виводимо “not a palindrome”.
'''

n = int(input("n ="))

mas = []


while n != 0:
    mas.append(n % 10)
    n = n // 10

count = len(mas) // 2
flag = True

for i in range(0, count, 1):
    if mas[i] != mas[len(mas) - 1 - i]:
        flag = False
        break

if flag == True:
    print("palindrome")
else:
    print("not a palindrome")
