'''
Створити список, який складатиметься з 8 значень дійсного типу. Організувати
введення цього списку з клавіатури. Поміняти місцями максимальний та мінімальний
елементи списку.
Пояснення розв’язку
Організовуємо цикл з параметром i, де і буде змінюватися від 0 до 7 з кроком 1. В
тілі циклу організовуємо введення значення дійсного типу у змінну el. Значення
змінної el заносимо в список mas.
Оголошуємо змінну max для знаходження максимального елемента списку та
присвоюємо їй початкове значення mas[0].
Оголошуємо змінну min для знаходження мінімального елемента списку та
присвоюємо їй початкове значення mas[0].
Оголошуємо ще дві змінні imax та imin для збереження відповідно індексів
максимального та мінімального елементів списку та присвоюємо їм значення 0.
Повторно використовуємо цикл з параметром i. В циклі перевіряємо чи чергове
значення списку mas є більшим за max, якщо так, то присвоюємо це значення
змінній max і при цьому змінній imax присвоюємо значення рівне i. Також
перевіряємо чи чергове значення списку mas є меншим за min, якщо так, то
присвоюємо це значення змінній min і при цьому змінній imin присвоюємо значення
рівне i.
Після завершення циклу робимо заміну mas[imax]= min, а mas[imin]=max.
Втретє використовуємо цикл з параметром i та організовуємо вивід елементів
списку mas на екран.
'''

mas = []

for i in range(8):
    el = float(input("el ="))
    mas.append(el)

max = mas[0]
min = mas[0]
imax = 0
imin = 0

for i in range(8):
    if mas[i] > max:
        max = mas[i]
        imax = i
    if mas[i] < min:
        min = mas[i]
        imin = i

mas[imax] = min
mas[imin] = max

for i in range(8):
    print(mas[i])