'''
Скласти програму знаходження об’єму прямокутного паралелепіпеда (об’єм прямокутного паралелепіпеда дорівнює добутку його ширини, довжини і висоти) Результатом виконання задачі є виведене на екран значення об’єму прямокутного паралелепіпеда

Додаткові умови

Вхідні дані вводяться з клавіатури користувачем
Можливі значення ширини, довжини і висоти - додатні дійсні числа
Використовувати функцію print лише один раз для виводу результату задачу
Очікуваний результат виконання програми:

Для набору вхідних даних (ширина = 2, довжина = 4, висота = 3) – текст на екрані – 24.0
'''
width = float(input("w ="))
length = float(input("l ="))
height = float(input("h ="))
result = width * length * height

print(result)
