'''
Напишіть функцію, яка приймає ціле число і друкує інформацію про парність чи
непарність числа.
Пояснення розв’язку
Описуємо допоміжний алгоритм, який назвемо parity_check. Нехай вхідним
параметром буде number. В тілі допоміжного алгоритму використаємо
розгалуження з умовою number%2 == 0. Якщо умова виконується то виводимо на
екран “The number is odd”, іншому випадку виводимо “The number is even”.
Організовуємо у головній програмі ввід числа у змінну n. Викликаємо допоміжний
алгоритм parity_check передавши йому n як параметр
'''

def parity_check(number):
    if number % 2 == 0:
        print("The number is even")
    else:
        print("The number is odd")

n = int(input("n ="))
parity_check(n)