'''
Напишіть функцію для визначення суми трьох цілих чисел. Якщо будь-які два значення
однакові, необхідно вивести нуль.
Пояснення розв’язку
Опишемо допоміжний алгоритм, який назвемо suma. Нехай вхідними параметрами
будуть num1, num2 та num3. В тілі алгоритму використовуємо змінну sum для
обчислення суми. Далі йде розгалуження з умовою num1== num2, якщо умова істинна
то змінній sum присвоюємо значення 0. Якщо умова хибна, то знову використовуємо
розгалуження з умовою num1==num3. У випадку істинності також sum присвоюємо
0, а у випадку хибності ще одне розгалуження, але умова num2== num3. Якщо умова
виконується то sum присвоюємо значення 0, у випадкухибності sum присвоюємо
значення num1+num2+num3.
Організовуємо у головній програмі введення 3 чисел a, b, c. Викликаємо
допоміжний алгоритм suma з параметрами a, b, c, а результат записуємо у
змінну result. Виводимо значення result на екран.
'''

def suma(num1, num2, num3):
    if num1 == num2:
        sum = 0
    else:
        if num1 == num3:
            sum = 0
        else:
            if num2 == num3:
                sum = 0
            else:
                sum = num1 + num2 + num3
    return sum

a = int(input("a ="))
b = int(input("b ="))
c = int(input("c ="))

result = suma(a, b, c)
print(result)