'''
Написати функцію обчислення НСД (найбільший спільний дільник). Скористайтеся
алгоритмом Евкліда
Пояснення розв’язку
Опишемо допоміжний алгоритм, який назвемо gsd.
Для розв'язання цієї задачі скористаємося рекурентним співвідношенням, яке
оформимо у вигляді допоміжного алгоритму gsd(num1,num2), де num1 та num2 –
числа для яких потрібно знайти НСД.
Рекурентне співвідношення – це формула, яка дозволяє обчислити наступні члени
числової послідовності через значення попередніх членів.
Отже вхідними параметрами будуть num1 та num2. В тілі алгоритму
використовуємо розгалуження з умовою num2==0, якщо умова істинні то
повертаємо з функції значення num1. Якщо умова хибна, то знову викликаємо
допоміжний алгоритм gsd, але вже з параметрами num2 та num1%num2 та
повертаємо результат його виконання.
І так до того часу поки не виконається умова num2==0.
Організовуємо у головній програмі введення 2 числа a, b. Викликаємо допоміжний
алгоритм gsd з параметрами a, b, а результат записуємо у змінну result.
Виводимо значення result на екран.
'''

def gsd(num1, num2):
    if num2 == 0:
        return num1
    else:
        return gsd(num2, num1 % num2)


a = float(input("a ="))
b = float(input("b ="))

result = gsd(a,b)

print(result)