#Оголосити дві змінні station_from і station_to.
#Присвоїти їм значення “Київ” і “Сімферополь” відповідно.
#Вивести на екран три рядки, використовуючи для цього створені змінні:
#Потяг їде зі станції Київ
#Потяг їде до станції Сімферополь
#Потяг їде зі станції Київ до станції Сімферополь
#Додаткові умови
#Мінімальна кількість змінних - 2

#Очікуваний результат виконання програми - текст на екрані:
#Потяг їде зі станції Київ
#Потяг їде до станції Сімферополь
#Потяг їде зі станції Київ до станції Сімферополь

station_from = "Київ"
station_to = "Сімферополь"

print("Потяг їде зі станції", station_from)
print("Потяг їде до станції", station_to)
print("Потяг їде зі станції", station_from, "до станції", station_to)