#Оголосити три змінні product, multiplier1, multiplier2
#Присвоїти їм значення 10, 2, 5 відповідно
#Вивести на екран результат операції порівняння, чи змінна product не дорівнює результату множення змінних multiplier1 і multiplier2
#Додавати додатковий текст до результату, який виводиться на екран, не потрібно.
#Додаткові умови:
#Мінімальна кількість змінних - 3

#Очікуваний результат виконання програми - текст на екрані:
#False

product = 10
multiplier1 = 2
multiplier2 = 5

print(product != multiplier1 * multiplier2)
