'''
Написати програму, яка створить дві множини set1 та set2, кожна з яких містить 5 елементів, що вводяться користувачем. Створити множину set3 з елементів, що не є спільними для двох множин set1 і set2. Вивести на екран множину set3.

Додаткові умови:
Користувач має ввести по 5 елементів для множин set1 та set2;
Не виводити додаткові символи в функції print окрім очікуваних;
Використовувати функцію print лише для виводу результату задачі.
Очікуваний результат виконання програми:

Для набору даних ('1', '2', '3', '4', '5', '6', '7', '8', '0', '1') – текст на екрані – {'2', '3', '4', '5', '6', '7', '8', '0'}
Для набору даних ('1', '1', '1', '1', '2', '1', '1', '1', '1', '3') – текст на екрані – {'2', '3'}
Для набору даних ('1', '3', '1', '1', '2', '1', '1', '1', '1', '3') – текст на екрані – {'2'}
Для набору даних ('1', '1', '1', '1', '1', '1', '1', '1', '1', '1') – текст на екрані – {}
'''

value1_1 = input("Введіть перший елемент першої множини ")
value1_2 = input("Введіть другий елемент першої множини ")
value1_3 = input("Введіть третій елемент першої множини ")
value1_4 = input("Введіть четвертий елемент першої множини ")
value1_5 = input("Введіть п'ятий елемент першої множини ")

value2_1 = input("Введіть перший елемент другої множини ")
value2_2 = input("Введіть другий елемент другої множини ")
value2_3 = input("Введіть третій елемент другої множини ")
value2_4 = input("Введіть четвертий елемент другої множини ")
value2_5 = input("Введіть п'ятий елемент другої множини ")

set1 = {value1_1, value1_2, value1_3, value1_4, value1_5}
set2 = {value2_1, value2_2, value2_3, value2_4, value2_5}

set3 = set1.symmetric_difference(set2)
set3 = set1 ^ set2

print(set3)