'''
Написати програму, що спробує видалити вказаний користувачем елемент з заданої множини. Вивести модифіковану множину на екран.

Додаткові умови:
Множина задана у вікні з кодом нижче;
Не виводити додаткові символи в функції print окрім очікуваних;
Якщо заданого елемента немає, то це не має викликати помилку під час виконання коду;
Використовувати функцію print лише для виводу результату задачі.
Очікуваний результат виконання програми:

Для набору даних ('1') – текст на екрані – "{'2', '3', '4', '5', '6', '7', '8', '9', '0'}"
Для набору даних ('sergii') – текст на екрані – "{'1', '2', '3', '4', '5', '6', '7', '8', '9', '0'}"
'''

str_set = {'1', '2', '3', '4', '5', '6', '7', '8', '9', '0'}
set_to_remove = input("Write ")
str_set.discard(set_to_remove)

print(str_set)