'''
Написати програму, що створить словник з цілочисельними ключами від 0 до введеного користувачем значення включно, і відповідними значеннями - квадрат ключа. Вивести створений словник на екран.

Додаткові умови:
Не виводити додаткові символи в функції print окрім очікуваних;
Можливе значення, введене користувачем, - додатне ціле число;
Використати цикл for;
Використовувати функцію print лише для виводу результату задачі.
Очікуваний результат виконання програми:

Для набору даних (5) – текст на екрані – {0:0, 1:1, 2:4, 3:9, 4:16, 5:25}
'''

n = int(input("Fill: "))
dict = {}

for i in range(n +1):
    dict[i] = i*i

print(dict)