'''
Написати програму, що перейменує ключ у словнику. Існуюче і нове значення ключа користувач має ввести з клавіатури. Вивести модифікований словник на екран.

Додаткові умови:
Не виводити додаткові символи в функції print окрім очікуваних.
Можливі значення введеного користувачем імені ключа - рядковий тип даних;
Можливі значення введеного користувачем нового імені - рядковий тип даних;
Якщо введеного користувачем ключа, який потрібно скопіювати немає - вивести повідомлення на екран "Шуканого ключа немає" і завершити виконання програми;
Використовувати функцію print лише для виводу результату задачі.
Очікуваний результат виконання програми:

Для набору даних (age, year_old) – текст на екрані – {'name': 'sergii', 'year_old': 100500, 'country': 'Ukraine'}
Для набору даних (profession, year_old) – текст на екрані – "Шуканого ключа немає"
'''

user = {
    'name': 'sergii',
    'age': '100500',
    'country': 'Ukraine'
}

key = input("Введіть ім'я ключа ")
new_key = input("Введіть нове ім'я ключа ")

if key in user:
    user[new_key] = user[key]
    del user[key]
    print(user)
else:
    print("Шуканого ключа немає")



