'''

Створіть програму визначення вартості дзвінка по телефону. Ціна за хвилину розмови 2.30 грн. У суботу та у неділю надається знижка 20%.
Пояснення розв’язку
Ввести номер дня тижня day та тривалість розмови time. Задано ціну за хвилину розмови price = 2.30. Порівнюємо номер дня тижня з числом 6 (субота) та числом
7 (неділя), якщо день тижня виявиться рівним 6 або 7, то обчислюємо ціну зі знижкою price= price*0.8 (без знижки коефіцієнт був би рівний 1). Якщо ж умова не виконується то price залишається без змін. Далі шукаємо добуток price та time і заносимо в змінну cost. Виводимо cost на екран.
'''

day = int(input())
time = int(input())
price = 2.30

if (day == 6 or day == 7):
    price = price * 0.8
cost = price * time

print(cost)

