'''
Скласти програму для визначення чи є фігура квадратом чи прямокутником за введеними значеннями двох довжин суміжних сторін чотирикутника (відомо, що всі кути цього чотирикутника дорівнюють 90 градусів). Результатом виконання задачі є виведене на екран повідомлення користувачу “Дана фігура - квадрат”, якщо її сторони рівні між собою, або “Дана фігура - прямокутник”, якщо сторони не рівні між собою.

Додаткові умови

Можливе значення довжин сторін - додатні дійсні числа
Використовувати функцію print лише один раз для виводу результату задачі
Очікуваний результат виконання програми:

Для набору даних (a = 2.1, b = 5) – текст на екрані - “Дана фігура - прямокутник”
Для набору даних (a = 2.1, b = 2.1) – текст на екрані - “Дана фігура - квадрат”
'''

a = float(input("a ="))
b = float(input("b ="))

if a == b:
    print("Дана фігура - квадрат")
else:
    print("Дана фігура - прямокутник")