'''
Скласти програму для визначення агрегатного стану води за відомим значенням її температури по шкалі Цельсія (температура - ціле число):

Якщо температура менша чи рівна 0 - вивести на екран текст "Лід";
Якщо температура більша за 0 і менше 100 градусів - вивести на екран текст "Вода";
Якщо температура більша чи рівна 100 - вивести на екран текст "Пара".
Додаткові умови:
Вхідні дані вводяться з клавіатури користувачем;
Можливі значення температури - цілі числа;
Використовувати функцію print лише для виводу результату задачі.
Очікуваний результат виконання програми:

Для набору даних (t= -2) – текст на екрані – “Лід”
Для набору даних (t= 0) – текст на екрані – “Лід”
Для набору даних (t=1) – текст на екрані – “Вода”
Для набору даних (t=100) – текст на екрані – “Пара”
Для набору даних (t=150) – текст на екрані – “Пара”
'''

t = int(input("t ="))

if t <= 0:
    res = "Лід"
else:
    if t < 100:
        res = "Вода"
    else:
        res = "Пара"

print(res)