'''
Реалізувати функцію, яка переводить введені користувачем милі в кілометри.

Додаткові умови:
Введене користувачем значення зберігається в змінній miles;
Функція має мати ім’я convert_miles_to_km;
Функція має один параметр - кількість миль (дійсне число);
Результат роботи функції - дійсне число;
Результат роботи функції має бути округлений до 2 знаків після коми;
Для розрахунків використовувати: 1 миля = 1.6 км;
Функція не має містити в собі директиву print
Очікуваний результат виконання програми:

Для набору вхідних даних (милі = 2) – функція повертає – 3.2
Для набору вхідних даних (милі = 3.3) – функція повертає – 5.28
'''

def convert_miles_to_km(miles):
    km = miles * 1.6
    return round(km, 2)

miles = float(input("Введіть кількість миль: "))
print(convert_miles_to_km(miles))