'''
Напишіть функцію яка перевірятиме чи введений рік високосний.
Пояснення розв’язку
Описуємо допоміжний алгоритм, який назвемо year_check. Нехай вхідним
параметром буде year. В тілі допоміжного алгоритму використаємо розгалуження з
умовою ((year%4 == 0) and (year%100 != 0)) or (year % 400 == 0) . Якщо
умова виконується то виводимо на екран “True”, іншому випадку виводимо “False”.
Організовуємо у головній програмі ввід числа у змінну n. Викликаємо допоміжний
алгоритм year_check передавши йому n як параметр.
'''

def year_check(year):
    if year % 4 == 0 and year % 100 != 0 or year % 400 ==0:
        print("True")
    else:
        print("False")

n = int(input("n ="))
year_check(n)
