'''
Використовуючи функцію max2(a,b), яка визначає максимальне з двох заданих
значень, написати функцію max3(a,b,c), що визначатиме максимальне з трьох даних
значень і організувати виклик цієї функції для обчислення суми найбільших значень
двох трійок довільних дійсних чисел
Пояснення розв’язку
Допоміжний алгоритм max2(a,b) аналогічний допоміжному алгоритму
max_two(a,b) з задачі 4. Щоб знайти найбільше з трьох чисел у допоміжному
алгоритмі max3(a,b,c) викличемо у ньому алгоритм max2(a,b) – так ми
знайдемо найбільше з перших двох чисел a i b , а потім знайдений результат і
третє число с будуть аргументами другого виклику допоміжного алгоритму
max2(max2(a,b),с).
'''

def max2(a, b):
    if a > b:
        max = a
    else:
        max = b
    return max

def max3(a, b, c):
    max = max2(max2(a, b), c)
    return max

a = float(input("a ="))
b = float(input("b ="))
c = float(input("c ="))
d = float(input("d ="))
e = float(input("e ="))
f = float(input("f ="))

result = max3(a, b, c) + max3(d, e, f)
print(result)