'''
Створити список, який містить 10 значень цілого типу. Організувати введення цього
списку з клавіатури. Вивести отриманий список на екран. Знайти суму всіх елементів
списку.
Пояснення розв’язку
Оголошуємо список mas.
Організовуємо цикл з параметром i, де і буде змінюватися від 0 до 9 з кроком 1. В
тілі циклу організовуємо введення значення цілого типу у змінну el. Значення змінної
el заносимо в список mas.
Повторно використовуємо цикл з параметром i та організовуємо вивід елементів
списку mas на екран.
Оголошуємо змінну sum для знаходження суми та присвоюємо їй значення 0.
Втретє використовуємо цикл з параметром i та почергово додаємо елементи
списку mas до значення змінної sum.
Виводимо значення sum на екран.
'''

mas = []

for i in range(10):
    el = int(input())
    mas.append(el)
for i in range(10):
    print(mas[i], end=" ")
sum = 0

for i in range(10):
    sum = sum + mas[i]
print()
print("Sum of element: ",sum)
