'''
Реалізувати програму, яка виводить послідовність чисел від 0 до введеного користувачем числа включно.
Кожне парне число має бути піднесено в квадрат перед виведенням, непарні числа виводяться без змін.

Додаткові умови:

Результат роботи програми- послідовність чисел;
Використати цикл while
Введене користувачем число зберігається в змінній number
'''

number = int(input("Введіть число"))
n = 0

while n <= number:
    if n % 2 == 0:
        print(n ** 2)
    else:
        print(n)
    n = n + 1