'''
Дано три цілих числа. Визначте, скільки серед них збігаються. Програма повинна вивести одне з чисел: 2 – якщо усі числа однакові, 1 – якщо два числа однакові, або 0 – якщо усі введені числа різні.
Пояснення розв’язку
Вводимо три числа a, b, c. Виберемо змінну count для результату. Початково присвоємо їй значення 0. Порівнюємо на рівність a і b. Якщо виявится що вони рівні, то count присвоюємо count + 1. Далі порівнюємо на рівність a і c. Якщо вони рівні, то знову count= count + 1.
Якщо ж при порівнянні a і b виявиться, що вони різні, то порівнюємо на рівність a і c. Якщо вони рівні, то count= count + 1, інакше порівнюємо на рівність b і c. У випадку рівності count= count + 1, якщо умова що b==c не виконується, то ніяких додаткових дій не виконуємо. І нарешті виводимо count.
'''

a = int(input("a ="))
b = int(input("b ="))
c = int(input("c ="))
count = 0

if a == b:
    count = count + 1
    if a == c:
        count = count + 1
else:
    if a == c:
       count = count + 1
    else: 
        if b == c:
            count = count + 1

print(count)



