'''
Дано два циліндра задані радіусами основи та висотами. Визначити, який з циліндрів
має більший об’єм.
Створіть функцію cylinder для обчислення об'єму циліндра. У параметрах вказати
радіус основи та висоту.
* Об'єм циліндра шукають за формулою pi * r ** 2 * h.
Пояснення розв’язку
Опишемо допоміжний алгоритм, який назвемо cylinder_volume. Нехай вхідними
параметрами будуть radius та height. В тілі алгоритму обчислюємо значення
змінної volume за формулою math.pi * radius ** 2 * height. Це значення і
повертатиметься в головний алгоритм.
Організовуємо у головній програмі введення 4 чисел, відповідно у змінні r1, h1 (для
першого циліндра), r2, h2 (для другого циліндра). Викликаємо допоміжний
алгоритм cylinder_volume з параметрами r1, h1 та повертаємо значення у
змінну v1 (для об'єму першого циліндра). Ще раз викликаємо cylinder_volume але
вже з параметрами r2, h2 та повертаємо результат у змінну v2 (для об'єму
другого циліндра). Тепер використовуючи розгалуження порівнюємо об'єми циліндрів.
Є три випадки, тому спочатку використовуємо порівняння v1> v2, якщо умова
виконується виводимо на екран “The first cylinder is larger”. Якщо ж умова не
виконується, то використовуємо ще одне розгалуження з умовою v1<v2, у випадку
істинності виводимо “The second cylinder is larger”, а у випадку хибності “The cylinders
are of equal size”
'''

import math

def cylinder_volume(radius, height):
    volume = math.pi * radius ** 2 * height
    return volume

r1 = float(input("r1 ="))
h1 = float(input("h1 ="))
r2 = float(input("r2 ="))
h2 = float(input("h2 ="))
v1 = cylinder_volume(r1, h1)
v2 = cylinder_volume(r2, h2)

if v1 > v2:
    print("The first cylinder is larger")
else:
    if v1 < v2:
        print("The second cylinder is larger")
    else:
        print("The cylinders are of equal size")
