'''
Дано три числа a, b, c. Змінній m присвоїти значення найбільшого з трьох чисел.
Пояснення розв’язку
Вводимо три числа a, b, c. Спочатку знаходимо більше з двох чисел: порівнюємо a та b, якщо а>=b, то m присвоюємо значення змінної a, інакше m присвоюємо значення b. Далі порівнюємо m з третім числом c, якщо m<c, то m присвоюємо значення c, інакше не виконуємо додаткових дій. В результаті виводимо значення змінної m.
'''

a = int(input("a ="))
b = int(input("b ="))
c = int(input("c ="))

if a >= b:
    m = a
else:
    m = b

if m < c:
    m = c

print(m)