'''
В університеті використовується наступна шкала для інтерпретації результатів тестування студентів: 90 балів і вище – оцінка A, 80-89 балів – оцінка B, 70-79 балів – оцінка C, 60-69 балів – оцінка D, нижче 60 – оцінка F. Напишіть програму, яка на основі введеного тестового балу повертає оцінку для цього балу.
Пояснення розв’язку
Ввести значення оцінки mark. Порівнюємо mark з 90, якщо mark>=90, то res присвоюємо “А”, далі перевіряємо mark>=80, то res присвоюємо “В”. Наступне порівняння mark>=70, і res = “C”, далі mark>=60, то res=”D”, і нарешті, res=”F”. Виводимо res на екран.
'''

mark = int(input("mark ="))

if mark >= 90:
    res = "A"
else:
    if mark >= 80:
        res = "B"
    else:
        if mark >= 70:
            res = "C"
        else:
            if mark >= 60:
                res = "D"
            else:
                res = "F"

print(res)