'''
Напишіть програму, в якій користувач вводить значення температури в градусах Цельсія, і, якщо це значення менше або дорівнює 0, необхідно вивести повідомлення “A cold, isn’t it?”. Якщо ж температура становить більше 0 і менше 10 градусів Цельсія повідомлення буде “Cool”, у інших випадках “Nice weather we’re having”.
Пояснення розв’язку
Вводимо значення змінної temp. Порівнюємо це значення з нулем, якщо temp<=0 то змінній res присвоюємо значення “A cold, isn’t it?”. Далі, якщо умова не виконується перевіряємо чи temp<10, якщо умова виконується змінній res присвоюємо “Cool”, інакше присвоюємо res значення “Nice weather we’re having”. Виводимо змінну res на екран.
'''

temp = float(input("temp ="))

if temp <=0:
    res = "A cold, isn’t it?"
else:
    if temp < 10:
        res = "Cool"
    else:
        res = "Nice weather we’re having"

print(res)