'''
Скласти програму для визначення парності чи непарності введеного цілого числа. Якщо число парне - вивести на екран текст “Введене число - парне”, якщо непарне - вивести на екран текст “Введене число - непарне”.

Додаткові умови

Можливе значення числа - додатне ціле число;
Використовувати функцію print лише для виводу результату задачі.
Підсказка.
Перевірити чи число парне чи ні можна використовуючи математичну операцію знаходження остачі від ділення: остача від ділення на 2 парних чисел дорівнює 0, непарних - дорівнює 1.

Очікуваний результат виконання програми:

Для набору даних (number=1) – текст на екрані – “Введене число - непарне”
Для набору даних (number=2) – текст на екрані – “Введене число - парне”
Для набору даних (number=3) – текст на екрані – “Введене число - непарне”
Для набору даних (number=9) – текст на екрані – “Введене число - непарне”
Для набору даних (number=22) – текст на екрані – “Введене число - парне”
'''

number = int(input("num ="))

if number % 2 == 0:
    res = "Введене число - парне"
else:
    res = "Введене число - непарне"

print(res)