'''
Створити програму, яка за допомогою функції range створює і виводить на екран список з цілими числами від 0 до введеного користувачем числа включно, шляхом додавання елементів до порожнього списку.

Додаткові умови:
Введене користувачем цілочисельне значення зберігається в змінній number;
Використати цикл for і функцію range;
Використовувати функцію print лише для виводу результату задачі.
Очікуваний результат виконання програми:

Для набору вхідних даних (1) – текст на екрані – [0, 1]
Для набору вхідних даних (11) – текст на екрані – [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
'''
