'''
Написати програму, що додасть до пустого словника пару ключ значення, яку користувач введе під час виконання програми. Вивести створений словник на екран.

Додаткові умови:
Не виводити додаткові символи в функції print окрім очікуваних.
Можливе значення введеного користувачем імені ключа - рядковий тип даних;
Можливе значення введеного користувачем значення ключа - рядковий тип даних;
Використовувати функцію print лише для виводу результату задачі.
Очікуваний результат виконання програми:

Для набору даних (age, 100500) – текст на екрані – "{'age': '100500'}"
'''

key = input("Введіть ім'я ключа ")
value = input("Введіть значення ключа ")

empty_dict = {}
empty_dict[key] = value

print(empty_dict)