'''
Написати програму, що порівнює два введених користувачем рядки, не враховуючи регістр символів.

Додаткові умови:
Не виводити додаткові символи в функції print окрім очікуваних;
Можливі значення введених користувачем рядків - рядковий тип даних;
Вивести на екран повідомлення: 'Рядки співпадають' чи 'Рядки не співпадають' відповідно до результату порівняння;
Використовувати функцію print лише для виводу результату задачі.
Очікуваний результат виконання програми:

Для набору даних ("Слава Україні!", "слава україні!") – текст на екрані – Рядки співпадають
Для набору даних ("Слава Україні!", "слава героям!") – текст на екрані – Рядки не співпадають
'''

line1 = input("Введіть перший рядок ")
line2 = input("Введіть другий рядок ")

if line1.upper() == line2.upper():
    print("Рядки співпадають")
else:
    print("Рядки не співпадають")
