'''
Написати програму, яка додає до початку існуючого кортежа (1, 2, 3) елемент, введений користувачем, і виводить цей кортеж на екран.

Додаткові умови:
Введене користувачем значення зберігається в змінній value;
Використовувати функцію print лише для виводу результату задачі.
Підказка.
Об'єднувати можна лише кортежі.

Очікуваний результат виконання програми:

Для набору даних ('1') – текст на екрані – ('1', 1, 2, 3)
Для набору даних ('sergii') – текст на екрані – ('sergii', 1, 2, 3)
'''

value = input("Введіть елемент ")
digits_tuple = (1, 2, 3)
new_digits_tuple = (value,) + digits_tuple

print(new_digits_tuple)
