# Автоматизація виводу елементів списку

'''
Задача:
Оператору компанії необхідно вивести кожне значення
заборгованостей по оплаті за газ в окремому рядку.
Розв'язок задачі:
В циклі для змінної element, що набуває значення
кожного елемента списку по черзі:
вивести значення element на екран
'''

gas_cost = [153, 200, 0]

for element in gas_cost:
    print(element)