'''
Напишіть програму, яка формує список з 10 цілих чисел - членів арифметичної прогресії (користувач задає значення першого члена і різницю арифметичної прогресії). Знайдіть суму десяти членів цієї арифметичної прогресії.
Пояснення розв’язку
Арифметична прогресія - це послідовність чисел, кожен член якої, починаючи з другого, утворюється додаванням до попереднього члена одного й того ж числа, яке
називають різницею прогресії. Наприклад, в прогресії 5, 8, 11, 14, 17, 20, 23, ... перший член прогресії – 5, різниця – 3.
Оголошуємо список mas.
Організовуємо ввід змінних first_elem та step з клавіатури.
Додаємо до списку mas значення first_elem.
Організовуємо цикл з параметром i, де і буде змінюватися від 1 до 9 з кроком 1. В
тілі циклу організовуємо введення списку за формулою mas.append(mas[i-1]+step).
Далі для підрахунку суми членів прогресії скористаємося розв'язком задачі 1 для знаходження суми елементів списку та виводимо результат на екран.
'''

mas = []

first_elem = int(input("fe ="))
step = int(input("step ="))
mas.append(first_elem)

for i in range(1, 10, 1):
    mas.append(mas[i-1] + step)

sum = 0

for i in range(0, 10, 1):
    sum = sum + mas[i]

print(sum)
