'''
Створити список , який складатиметься з 6 значень дійсного типу. Організувати
введення цього списку з клавіатури. Знайти максимальний елемент списку
Пояснення розв’язку
Оголошуємо список mas.
Організовуємо цикл з параметром i, де і буде змінюватися від 0 до 5 з кроком 1. В
тілі циклу організовуємо введення значення дійсного типу у змінну el. Значення
змінної el заносимо в список mas.
Оголошуємо змінну max для знаходження максимального елемента списку та
присвоюємо їй значення першого елемента списку (списку) mas [0].
Повторно використовуємо цикл з параметром i. В циклі перевіряємо чи чергове
значення списку mas є більшим за max, якщо так, то присвоюємо це значення
змінній max.
Виводимо значення max на екран.
'''

mas = []

for i in range(6):
    el = float(input("el ="))
    mas.append(el)

max = mas[0]

for i in range(6):
    if mas[i] > max:
        max = mas[i]

print(max)