# Автоматизація опрацювання множин за допомогою циклів
''' 
Задача:
Вивести назви усіх зареєстрованих країн
Розв'язок задачі:
В циклі для змінної country, що набуває значення
кожного елементу множини, по черзі:
 вивести значення country на екран
'''

countries = {"Ukraine", "Poland", "Great Britain"}

for countrie in countries:
    print(countrie)
